
&НаКлиенте
Процедура ДосрочноеПогашениеПриИзменении(Элемент)
	Элементы.ГруппаДосрочноеПогашение.Видимость = ДосрочноеПогашение;  
	ПроизвестиРасчет();
КонецПроцедуры  

&НаКлиенте
Процедура ПроизвестиРасчет()  
	Массив = Новый Массив();
	
	Если ДосрочноеПогашение и СуммаДосрочногоПогашения > СуммаЗайма / 2 тогда
		//Предупреждение("Вернуть можно не больше половины суммы займа",30,"Внимание!!!");
		Сообщить("Вернуть можно не больше половины суммы займа");
	иначе
		ВсегоДней = (ДатаВозвратаЗайма - ДатаПолученияЗайма	) / 24/60/60;   
		СуммаКВозврату = СуммаЗайма;
		Для НомерДня = 1 по ВсегоДней цикл
			ТекущийДень =  ДатаПолученияЗайма + НомерДня * 24 * 60 * 60 ;
			СтавкаВДень = ПроцентнаяСтавка / ДеньГода(КонецГода(ТекущийДень)) / 100; 
			Если ДеньНедели(ТекущийДень) < 6 тогда
				СуммаКВозврату = СуммаКВозврату * ( 1 + СтавкаВДень);
			КонецЕсли;
			Если ДосрочноеПогашение и НачалоДня(ТекущийДень) = НачалоДня(ДатаДосрочногоПогашения) тогда
				СуммаКВозврату = СуммаКВозврату - СуммаДосрочногоПогашения;	
			КонецЕсли;  		
			ТекущийДень = ТекущийДень + 24*60*60		;
		КонецЦикла;
		Переплата = СуммаКВозврату + ?(ДосрочноеПогашение,СуммаДосрочногоПогашения,0) - СуммаЗайма;		
	КонецЕсли;	
КонецПроцедуры

&НаКлиенте
Процедура Произвести(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	// Вставить содержимое обработчика.
КонецПроцедуры


